app/Http/Controllers/ArticlesController.php

    public function index()
    {
        $articles = \App\Article::latest()->paginate(3);
---
select * from `articles` order by `created_at` desc limit 3 offset 0
select count(*) as aggregate from `articles`